# 1. 홀수 리스트 [1, 3, 5, 7, 9]를 odd라는 변수에 저장해보세요.
# odd = 

# 2. 리스트 [1, 2, 3]과 [4, 5, 6]을 더해서 새로운 리스트를 만들어보세요.
# result = 

# 결과 출력
print(f"2. 리스트를 더한 결과: {result}")

# 3. 리스트 [1, 2, 3, ['a', 'b', 'c']]에서 'a' 값을 인덱싱을 통해 추출해보세요.
# value = 

# 결과 출력
print(f"3. 추출한 값: {value}")

# 4. 리스트 [1, 2, 3, 4, 5]에서 2번째부터 4번째 요소를 슬라이싱해보세요.
# sliced = 

# 결과 출력
print(f"4. 슬라이싱된 리스트: {sliced}")

# 5. 리스트 [1, 2, 3, 4, 5]에 6을 추가해보세요.
# list_a = [1, 2, 3, 4, 5]


# 결과 출력
print(f"5. 6을 추가한 리스트: {list_a}")

# 6. 리스트 [1, 4, 3, 2]를 정렬해보세요.
# list_b = [1, 4, 3, 2]


# 결과 출력
print(f"6. 정렬된 리스트: {list_b}")

# 7. 리스트 [1, 2, 3, 1, 2, 3]에서 숫자 3을 모두 제거해보세요.
# list_c = [1, 2, 3, 1, 2, 3]


# 결과 출력
print(f"7. 숫자 3을 제거한 리스트: {list_c}")

# 정답
# 1번 답: odd = [1, 3, 5, 7, 9]
# 2번 답: result = [1, 2, 3] + [4, 5, 6]
# 3번 답: value = [1, 2, 3, ['a', 'b', 'c']][-1][0]
# 4번 답: sliced = [1, 2, 3, 4, 5][1:4]
# 5번 답: list_a.append(6)
# 6번 답: list_b.sort()
# 7번 답: list_c.remove(3), list_c.remove(3)
